{
  "recipes": [
  {
    "name": "Harees",
    "imageName": "harees",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/harees.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": false,
    "healthTags": ["high-protein", "comfort-food"],
    "dietaryTags": ["dairy-free-option"],
    "mealType": "dinner",
    "difficulty": "medium",
    "prepTime": 120,
    "cookTime": 180,
    "spiceLevel": "mild",
    "servings": 6,
    "calories": 450,
    "protein": 30,
    "carbs": 50,
    "fat": 15,
    "allergens": ["gluten"],
    "cookingMethod": "slow-cooking",
    "specialDiet": [],
    "occasionTags": ["festive-dish", "ramadan"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "500g Crushed Wheat (Harees Wheat)",
      "1kg Boneless Chicken or Lamb",
      "2-3 Liters Water or Chicken Stock",
      "1/2 cup Ghee (Clarified Butter)",
      "Salt to taste",
      "Cinnamon powder (for garnish)"
    ],
    "requiredIngredients": ["crushed wheat", "chicken/lamb", "ghee"],
    "instructions": [
      "Wash the crushed wheat thoroughly several times until the water runs clear. Soak the wheat in cold water for at least 6-8 hours, or preferably overnight.",
      "Drain the soaked wheat. In a large, heavy-bottomed pot, combine the drained wheat and the boneless chicken or lamb.",
      "Add 2-3 liters of water or chicken stock to the pot, ensuring the meat and wheat are well submerged.",
      "Bring the mixture to a rolling boil over high heat, skimming off any foam that rises to the surface.",
      "Once boiling, reduce the heat to the lowest setting. Cover the pot tightly and let it simmer for at least 2-3 hours.",
      "During simmering, stir occasionally with a wooden spoon to prevent sticking and break down the meat and wheat.",
      "After 2-3 hours, remove the pot from the heat. Carefully remove the cooked meat from the pot.",
      "Using a sturdy wooden paddle or a hand blender, vigorously mash the wheat until it forms a smooth, porridge-like consistency, free of lumps.",
      "Shred the cooked meat (chicken or lamb) and return it to the pot with the mashed wheat. Stir well to combine.",
      "Season the Harees generously with salt to taste. The Harees should be thick and creamy.",
      "Melt the ghee in a small pan until it's very hot and fragrant. Ladle the Harees into serving dishes, drizzle generously with hot ghee, and sprinkle with cinnamon powder before serving."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Machboos (Laham/Dajaj Machboos)",
    "imageName": "machboos",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/machboos.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": false,
    "healthTags": ["complex-carbs", "high-protein"],
    "dietaryTags": ["gluten-free-option"],
    "mealType": "dinner",
    "difficulty": "medium",
    "prepTime": 30,
    "cookTime": 60,
    "spiceLevel": "medium",
    "servings": 4,
    "calories": 750,
    "protein": 40,
    "carbs": 80,
    "fat": 30,
    "allergens": [],
    "cookingMethod": "stovetop-steaming",
    "specialDiet": [],
    "occasionTags": ["festive-dish", "family-meal"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "500g Basmati Rice",
      "1kg Lamb or Chicken (cut into pieces)",
      "2 large Onions, sliced",
      "2 Tomatoes, chopped",
      "Machboos Spice Mix (Dried Limes, Cardamom, Cinnamon, Cloves)",
      "Garlic and Ginger paste",
      "Chilies (optional)",
      "Saffron threads, soaked in warm water",
      "Oil/Ghee, Salt, Fresh Coriander"
    ],
    "requiredIngredients": ["basmati rice", "lamb/chicken", "dried limes", "machboos spice"],
    "instructions": [
      "Wash the Basmati rice thoroughly and soak it in cold water for 30 minutes. Drain well.",
      "In a large, heavy-bottomed pot, heat oil or ghee and brown the lamb or chicken pieces on all sides. Remove and set aside.",
      "In the same pot, sauté the sliced onions until deeply golden brown and caramelized, stirring frequently.",
      "Add the garlic and ginger paste, chopped chilies (if using), and the whole Machboos spices (dried limes, cardamom, cinnamon, cloves). Fry for 2-3 minutes until fragrant.",
      "Add the chopped tomatoes and cook until they break down and form a thick sauce.",
      "Return the browned meat to the pot. Add enough hot water or stock to cover the meat, season with salt, and bring to a boil.",
      "Reduce heat, cover, and simmer for 30-40 minutes for chicken, or 60-90 minutes for lamb, until the meat is tender.",
      "Carefully remove the cooked meat from the pot and set aside. Keep the flavorful cooking broth.",
      "Bring the broth to a rolling boil. Add the drained Basmati rice, ensuring the broth level is about 1 inch above the rice. If needed, add more water.",
      "Once the liquid level has reduced to just above the rice surface, create a few holes in the rice with a spoon handle.",
      "Drizzle the saffron-infused water over the rice, return the meat to the top, cover tightly, and steam on very low heat for 15-20 minutes until the rice is cooked and fluffy.",
      "Fluff the rice gently with a fork before serving, ensuring the meat is mixed through. Garnish with fresh coriander."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Thareed (Lamb & Vegetable Stew)",
    "imageName": "thareed",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/thareed.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": false,
    "healthTags": ["high-fiber", "nutrient-dense"],
    "dietaryTags": ["dairy-free", "gluten-free-option"],
    "mealType": "dinner",
    "difficulty": "medium",
    "prepTime": 20,
    "cookTime": 90,
    "spiceLevel": "mild-medium",
    "servings": 6,
    "calories": 520,
    "protein": 35,
    "carbs": 40,
    "fat": 25,
    "allergens": [],
    "cookingMethod": "stovetop-simmering",
    "specialDiet": [],
    "occasionTags": ["ramadan", "comfort-food"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "500g Lamb or Beef, cubed",
      "2 large Onions, chopped",
      "Mixed Vegetables (Potatoes, Carrots, Zucchini, Pumpkin, Eggplant)",
      "2 Tomatoes, chopped",
      "1 can Chickpeas, drained",
      "Thareed Spice Mix (Turmeric, Cumin, Coriander, Black Pepper)",
      "Tomato Paste",
      "Garlic, Ginger, Dried Limes",
      "Oil/Ghee, Water/Stock, Salt",
      "Regag Bread (thin flatbread) for serving"
    ],
    "requiredIngredients": ["lamb/beef", "mixed vegetables", "dried limes", "regag bread"],
    "instructions": [
      "In a large, heavy-bottomed pot, heat oil or ghee and brown the lamb or beef cubes on all sides.",
      "Add the chopped onions and sauté until softened and translucent, then add the minced garlic and ginger, frying for another minute.",
      "Stir in the Thareed spice mix (turmeric, cumin, coriander, black pepper) and fry for a minute until fragrant.",
      "Add the chopped tomatoes, tomato paste, and whole dried limes. Cook until the tomatoes break down and the paste darkens slightly.",
      "Add enough hot water or stock to cover the meat. Bring to a boil, then reduce heat, cover, and simmer for 60-90 minutes until the meat is tender.",
      "While the meat simmers, prepare the vegetables by peeling and cutting them into large, rustic chunks.",
      "After the meat is tender, add the harder vegetables first (potatoes, carrots). Simmer for 15 minutes.",
      "Then add the softer vegetables (zucchini, pumpkin, eggplant, drained chickpeas). Simmer for another 15-20 minutes, or until all vegetables are tender but not mushy.",
      "Season the stew generously with salt to taste. The broth should be rich and flavorful.",
      "To serve, arrange pieces of traditional thin Regag bread (or other flatbread) at the bottom of a large serving dish.",
      "Ladle the hot Thareed stew generously over the bread, allowing the bread to soak up the delicious broth.",
      "Serve immediately, usually as a communal dish."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Saloona (Emirati Vegetable Stew)",
    "imageName": "saloona",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/saloona.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": false,
    "healthTags": ["nutrient-dense", "high-fiber"],
    "dietaryTags": ["dairy-free", "gluten-free-option"],
    "mealType": "dinner",
    "difficulty": "easy",
    "prepTime": 15,
    "cookTime": 45,
    "spiceLevel": "mild",
    "servings": 4,
    "calories": 380,
    "protein": 25,
    "carbs": 30,
    "fat": 15,
    "allergens": [],
    "cookingMethod": "stovetop-simmering",
    "specialDiet": [],
    "occasionTags": ["everyday", "comfort-food"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "500g Chicken (cut into pieces) or Beef cubes",
      "Mixed Vegetables (Potatoes, Carrots, Zucchini, Pumpkin, Bell Peppers)",
      "1 large Onion, chopped",
      "2 Tomatoes, chopped",
      "Garlic, Ginger, Green Chilies",
      "Saloona Spice Mix (Turmeric, Cumin, Coriander, Black Pepper)",
      "Tomato Paste",
      "Water/Stock, Salt, Fresh Coriander"
    ],
    "requiredIngredients": ["chicken/beef", "mixed vegetables", "tomato", "saloona spices"],
    "instructions": [
      "Prepare all vegetables by peeling and cutting them into medium-sized chunks.",
      "In a large pot, heat a little oil and sauté the chopped onion until softened and translucent.",
      "Add the minced garlic, ginger, and green chilies (if using). Fry for 1-2 minutes until fragrant.",
      "Stir in the Saloona spice mix (turmeric, cumin, coriander, black pepper) and fry for another minute.",
      "Add the chicken pieces or beef cubes to the pot and brown them lightly on all sides.",
      "Stir in the chopped tomatoes and tomato paste. Cook until the tomatoes break down and the paste darkens slightly.",
      "Pour in enough hot water or stock to just cover the meat and vegetables. Season with salt.",
      "Bring the stew to a boil, then reduce the heat to low, cover the pot, and simmer for 30-40 minutes (for chicken) or 60-90 minutes (for beef) until the meat is tender.",
      "Add the remaining vegetables (if any were not added initially) and continue to simmer for another 15-20 minutes, or until all vegetables are tender but still retain their shape.",
      "Adjust the seasoning as needed. The Saloona should be a well-balanced, mildly spiced stew.",
      "Garnish with fresh coriander before serving.",
      "Serve hot with steamed white rice or traditional Emirati bread like Regag."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Margougat (Meat and Vegetable Stew with Dough)",
    "imageName": "margougat",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/margougat.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": false,
    "healthTags": ["hearty-meal", "complex-carbs"],
    "dietaryTags": ["dairy-free"],
    "mealType": "dinner",
    "difficulty": "medium",
    "prepTime": 30,
    "cookTime": 90,
    "spiceLevel": "mild",
    "servings": 6,
    "calories": 650,
    "protein": 30,
    "carbs": 60,
    "fat": 30,
    "allergens": ["gluten"],
    "cookingMethod": "stovetop-simmering",
    "specialDiet": [],
    "occasionTags": ["comfort-food", "ramadan"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "500g Lamb or Chicken (cut into pieces)",
      "Mixed Vegetables (Potatoes, Carrots, Zucchini, Pumpkin, Eggplant)",
      "1 large Onion, chopped",
      "2 Tomatoes, chopped",
      "Garlic, Ginger, Green Chilies",
      "Emirati Bzaar Spice Mix (Baharat, Turmeric, Cumin, Coriander)",
      "Tomato Paste",
      "Water/Stock, Salt",
      "Dough for dumplings (Flour, Water, Salt)"
    ],
    "requiredIngredients": ["lamb/chicken", "mixed vegetables", "bzaar spice", "dough"],
    "instructions": [
      "Prepare the dough: mix flour, water, and a pinch of salt. Knead until smooth, cover, and let rest for 30 minutes. Divide into small balls.",
      "In a large, heavy-bottomed pot, heat oil and brown the lamb or chicken pieces on all sides. Remove and set aside.",
      "In the same pot, sauté the chopped onions until softened and translucent. Add minced garlic, ginger, and green chilies. Fry for 1-2 minutes.",
      "Stir in the Emirati Bzaar spice mix and fry for another minute until fragrant.",
      "Add the chopped tomatoes and tomato paste. Cook until the tomatoes break down and the paste darkens.",
      "Return the browned meat to the pot. Add enough hot water or stock to cover the meat. Season with salt.",
      "Bring to a boil, then reduce heat, cover, and simmer for 60-90 minutes (lamb) or 30-40 minutes (chicken) until meat is tender.",
      "Add the harder vegetables (potatoes, carrots, pumpkin) to the stew. Simmer for 15 minutes.",
      "While the vegetables cook, roll out the dough balls into very thin, small discs or tear into rustic pieces.",
      "Add the softer vegetables (zucchini, eggplant) to the stew. Drop the dough pieces one by one into the simmering stew, ensuring they don't stick together.",
      "Simmer for another 15-20 minutes, or until the vegetables are tender and the dough pieces are cooked through and fluffy.",
      "Adjust the seasoning as needed. The stew should be hearty and flavorful.",
      "Serve the Margougat hot as a complete one-pot meal, with the dough pieces absorbing the rich broth."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Luqaimat (Sweet Dumplings)",
    "imageName": "luqaimat",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/luqaimat.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": true,
    "healthTags": ["sweet-treat", "dessert"],
    "dietaryTags": ["dairy-free-option"],
    "mealType": "dessert-snack",
    "difficulty": "medium",
    "prepTime": 60,
    "cookTime": 20,
    "spiceLevel": "mild",
    "servings": 8,
    "calories": 300,
    "protein": 5,
    "carbs": 45,
    "fat": 15,
    "allergens": ["gluten", "dairy-optional"],
    "cookingMethod": "deep-fry",
    "specialDiet": ["vegetarian"],
    "occasionTags": ["ramadan", "festive-dish"],
    "storageType": "best-fresh",
    "kidFriendly": true,
    "ingredients": [
      "2 cups All-Purpose Flour",
      "1 Tbsp Yeast",
      "1/2 cup Milk Powder (optional, for richness)",
      "1 Tbsp Sugar",
      "1/2 tsp Cardamom powder",
      "1.5 cups Warm Water",
      "Oil for deep-frying",
      "Date Syrup (Dibbs) or Honey for drizzling",
      "Sesame seeds (for garnish)"
    ],
    "requiredIngredients": ["flour", "yeast", "warm water", "date syrup"],
    "instructions": [
      "In a large mixing bowl, combine the flour, yeast, milk powder (if using), sugar, and cardamom powder.",
      "Gradually add the warm water, mixing until a smooth, slightly sticky batter forms. It should be thicker than pancake batter but pourable.",
      "Cover the bowl with a clean cloth or plastic wrap and let the batter rise in a warm place for 45-60 minutes, or until it has doubled in size.",
      "Gently punch down the risen dough to release the air.",
      "Heat a deep pot or wok with plenty of oil for deep-frying to 170°C (340°F).",
      "To form the Luqaimat: wet your hand, squeeze a small amount of dough through your fist, and use a spoon to scoop off the small ball directly into the hot oil.",
      "Alternatively, use two small spoons to drop small, round portions of dough into the hot oil.",
      "Fry the Luqaimat in batches, turning frequently, until they are golden brown and crispy on all sides.",
      "Ensure they are cooked through but not burnt. Remove with a slotted spoon and place on paper towels to drain excess oil.",
      "While still hot, arrange the Luqaimat on a serving platter and generously drizzle with date syrup (Dibbs) or honey.",
      "Sprinkle with a handful of sesame seeds for added flavor and texture.",
      "Serve immediately while warm and crispy on the outside, soft on the inside."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Balaleet (Sweet Vermicelli with Omelette)",
    "imageName": "balaleet",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/balaleet.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": true,
    "healthTags": ["breakfast", "sweet-savory"],
    "dietaryTags": ["ovo-lacto-vegetarian"],
    "mealType": "breakfast-dessert",
    "difficulty": "easy",
    "prepTime": 10,
    "cookTime": 20,
    "spiceLevel": "mild",
    "servings": 4,
    "calories": 350,
    "protein": 10,
    "carbs": 45,
    "fat": 15,
    "allergens": ["gluten", "eggs", "dairy-optional"],
    "cookingMethod": "stovetop-frying",
    "specialDiet": ["vegetarian"],
    "occasionTags": ["eid-celebration", "ramadan-suhoor"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "200g Thin Vermicelli Noodles",
      "2-3 Eggs, beaten",
      "1/4 cup Sugar (or more to taste)",
      "1/2 tsp Cardamom powder",
      "Saffron threads, soaked in warm water",
      "1 Tbsp Rose Water (optional)",
      "Ghee/Oil for frying",
      "Pistachios (for garnish, optional)"
    ],
    "requiredIngredients": ["vermicelli", "eggs", "sugar", "cardamom", "saffron"],
    "instructions": [
      "In a dry pan, lightly toast the vermicelli noodles over medium heat until they turn a light golden color, stirring constantly to prevent burning.",
      "Add enough hot water to cover the toasted vermicelli. Cook for 2-3 minutes until al dente. Drain thoroughly and set aside.",
      "In the same pan, melt a tablespoon of ghee or oil. Add the drained vermicelli and sprinkle with sugar, cardamom powder, saffron-infused water, and rose water (if using).",
      "Gently stir-fry the vermicelli for 5-7 minutes over low heat, allowing the sugar to melt and coat the noodles, and for the flavors to infuse.",
      "While the vermicelli is cooking, prepare the omelette. Beat the eggs lightly with a pinch of salt.",
      "In a separate non-stick pan, heat a little oil or ghee. Pour in the beaten eggs to make a thin omelette.",
      "Cook until set, then fold or roll the omelette. Remove from heat and slice it into strips or desired shapes.",
      "Once the vermicelli is fragrant and slightly caramelized, transfer it to a serving plate.",
      "Carefully place the sliced egg omelette on top of the sweet vermicelli.",
      "Garnish with a sprinkle of chopped pistachios (optional) for color and texture.",
      "Serve Balaleet warm, often as a hearty breakfast dish or a sweet accompaniment during festive occasions like Eid."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Assidat Al Boubar (Pumpkin Pudding)",
    "imageName": "assidat_al_boubar",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/assidat_al_boubar.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": true,
    "healthTags": ["fiber-rich", "vitamin-rich"],
    "dietaryTags": ["gluten-free", "dairy-free"],
    "mealType": "dessert",
    "difficulty": "easy",
    "prepTime": 20,
    "cookTime": 40,
    "spiceLevel": "mild",
    "servings": 6,
    "calories": 280,
    "protein": 5,
    "carbs": 40,
    "fat": 12,
    "allergens": ["coconut"],
    "cookingMethod": "stovetop-simmering",
    "specialDiet": ["vegetarian", "vegan"],
    "occasionTags": ["festive-dish", "ramadan"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "500g Pumpkin, peeled and cubed",
      "1 can Coconut Milk (400ml)",
      "1/2 cup Rice Flour",
      "1/2 cup Sugar (or more to taste)",
      "1/2 tsp Cardamom powder",
      "Saffron threads, soaked in warm water",
      "1 Tbsp Rose Water (optional)",
      "Ghee/Oil (for greasing)",
      "Pistachios/Almonds (for garnish)"
    ],
    "requiredIngredients": ["pumpkin", "coconut milk", "rice flour", "cardamom", "saffron"],
    "instructions": [
      "Peel and cube the pumpkin into small, uniform pieces. Boil or steam the pumpkin until it is very soft and easily mashable.",
      "Drain the cooked pumpkin well and mash it into a smooth puree using a fork, potato masher, or food processor.",
      "In a large non-stick pot, combine the mashed pumpkin puree, coconut milk, rice flour, sugar, cardamom powder, saffron-infused water, and rose water (if using).",
      "Whisk all ingredients together thoroughly to ensure there are no lumps, especially from the rice flour.",
      "Place the pot over medium-low heat and cook, stirring continuously with a wooden spoon or whisk, to prevent sticking and burning.",
      "Continue to cook and stir for 20-30 minutes, or until the pudding thickens significantly and pulls away from the sides of the pot.",
      "The pudding should be very thick and glossy. Taste and adjust the sugar level to your preference.",
      "Lightly grease a serving dish or individual ramekins with a little ghee or oil.",
      "Spoon the hot pumpkin pudding into the prepared dish(es), smoothing the top with the back of a spoon.",
      "Allow the pudding to cool slightly at room temperature, then chill in the refrigerator for at least 2 hours to set completely.",
      "Before serving, garnish generously with chopped pistachios, slivered almonds, or a sprinkle of cinnamon powder.",
      "Serve Assidat Al Boubar chilled as a refreshing and traditional Emirati dessert."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Khameer (Emirati Bread)",
    "imageName": "khameer",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/khameer.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": true,
    "healthTags": ["whole-grains-option", "source-of-carbs"],
    "dietaryTags": ["dairy-free-option"],
    "mealType": "breakfast-side-dish",
    "difficulty": "medium",
    "prepTime": 90,
    "cookTime": 20,
    "spiceLevel": "mild",
    "servings": 8,
    "calories": 220,
    "protein": 8,
    "carbs": 35,
    "fat": 5,
    "allergens": ["gluten", "dairy-optional"],
    "cookingMethod": "stovetop-griddle",
    "specialDiet": ["vegetarian"],
    "occasionTags": ["everyday", "tea-time"],
    "storageType": "best-fresh",
    "kidFriendly": true,
    "ingredients": [
      "3 cups All-Purpose Flour (or whole wheat flour)",
      "1 Tbsp Instant Yeast",
      "1/2 cup Milk Powder (optional, for softness)",
      "1/4 cup Sugar",
      "1/2 tsp Cardamom powder",
      "1/2 tsp Saffron threads, soaked in warm milk/water",
      "1 cup Warm Water (or milk)",
      "2 Tbsp Ghee or Oil",
      "Pinch of Salt",
      "Egg yolk for brushing (optional)"
    ],
    "requiredIngredients": ["flour", "yeast", "warm water", "cardamom"],
    "instructions": [
      "In a large mixing bowl, combine the flour, yeast, milk powder (if using), sugar, cardamom powder, and salt.",
      "Add the saffron-infused water/milk and the warm water/milk gradually to the dry ingredients, mixing to form a rough dough.",
      "Transfer the dough to a lightly floured surface and knead for 10-15 minutes until it is smooth, elastic, and no longer sticky.",
      "Place the kneaded dough in a lightly oiled bowl, cover with a clean cloth, and let it rise in a warm place for 1 hour, or until doubled in size.",
      "Once risen, gently punch down the dough to release the air and divide it into 8-10 equal balls.",
      "On a lightly floured surface, roll out each dough ball into a flat, circular disc about 1/4 inch thick.",
      "Preheat a heavy-bottomed griddle or non-stick pan over medium heat.",
      "Brush each flattened dough disc with a little melted ghee or oil. If desired, brush with egg yolk for a golden finish.",
      "Place a dough disc onto the hot griddle. Cook for 2-3 minutes per side until puffed up and golden brown, with characteristic slight charring.",
      "Cook all the Khameer breads in batches, stacking them to keep them warm.",
      "Serve Khameer warm, often with cheese, honey, date syrup, or alongside savory stews like Saloona for breakfast or afternoon tea."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Jesheed (Shark Meat with Rice)",
    "imageName": "jesheed",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/jesheed.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Coastal",
    "isVegetarian": false,
    "healthTags": ["high-protein", "omega-3"],
    "dietaryTags": ["gluten-free-option"],
    "mealType": "dinner",
    "difficulty": "medium",
    "prepTime": 20,
    "cookTime": 40,
    "spiceLevel": "medium",
    "servings": 4,
    "calories": 680,
    "protein": 45,
    "carbs": 60,
    "fat": 25,
    "allergens": ["fish"],
    "cookingMethod": "stovetop-steaming",
    "specialDiet": ["pescatarian"],
    "occasionTags": ["traditional-cuisine", "coastal-specialty"],
    "storageType": "best-fresh",
    "kidFriendly": false,
    "ingredients": [
      "500g Shark Meat (fresh or dried/salted)",
      "2 cups Basmati Rice",
      "2 large Onions, finely chopped",
      "2 Tomatoes, chopped",
      "Garlic, Ginger, Green Chilies",
      "Jesheed Spice Mix (Turmeric, Cumin, Coriander, Dried Limes)",
      "Water, Oil, Salt, Fresh Coriander"
    ],
    "requiredIngredients": ["shark meat", "basmati rice", "dried limes", "spice mix"],
    "instructions": [
      "If using fresh shark, clean thoroughly and par-boil for 10 minutes to remove excess oil and smell. Flake the meat after boiling.",
      "If using dried/salted shark, soak overnight, then boil for 30 minutes, drain, and flake the meat. This step is crucial.",
      "Wash the Basmati rice and soak in cold water for 30 minutes. Drain well.",
      "In a large pot, heat oil and sauté the finely chopped onions until softened and golden brown.",
      "Add minced garlic, ginger, and green chilies. Fry for 1-2 minutes until fragrant.",
      "Stir in the Jesheed spice mix (turmeric, cumin, coriander) and crumbled dried limes. Fry for another minute.",
      "Add the chopped tomatoes and cook until they break down and form a thick sauce.",
      "Add the flaked shark meat to the pot. Stir well to combine with the spices and tomatoes.",
      "Pour in enough hot water to just cover the mixture, season lightly with salt (consider if shark was salted), and bring to a simmer.",
      "Add the drained Basmati rice on top of the shark mixture. Ensure the water level is appropriate for cooking rice (about 1 inch above the rice).",
      "Cover the pot tightly and cook on very low heat for 20-25 minutes, or until the rice is cooked and fluffy.",
      "Gently fluff the Jesheed with a fork before serving, mixing the rice and flaked fish throughout. Garnish with fresh coriander."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Fouga (Fish Rice)",
    "imageName": "fouga",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/fouga.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Coastal",
    "isVegetarian": false,
    "healthTags": ["high-protein", "omega-3"],
    "dietaryTags": ["gluten-free-option"],
    "mealType": "dinner",
    "difficulty": "medium",
    "prepTime": 30,
    "cookTime": 50,
    "spiceLevel": "medium",
    "servings": 4,
    "calories": 620,
    "protein": 40,
    "carbs": 65,
    "fat": 20,
    "allergens": ["fish"],
    "cookingMethod": "stovetop-steaming",
    "specialDiet": ["pescatarian"],
    "occasionTags": ["family-meal", "coastal-cuisine"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "500g White Fish Fillets (e.g., Kingfish, Hammour)",
      "2 cups Basmati Rice",
      "2 large Onions, sliced",
      "2 Tomatoes, chopped",
      "Fouga Spice Mix (Cumin, Coriander, Turmeric, Dried Limes)",
      "Garlic and Ginger paste",
      "Saffron threads, soaked in warm water",
      "Oil/Ghee, Salt, Fresh Parsley"
    ],
    "requiredIngredients": ["white fish", "basmati rice", "dried limes", "spice mix"],
    "instructions": [
      "Wash the Basmati rice and soak it in cold water for 30 minutes. Drain well.",
      "Rub the fish fillets generously with salt, turmeric, and black pepper. Pan-fry or deep-fry the fish until golden and cooked through. Set aside.",
      "In a large, heavy-bottomed pot, heat oil or ghee and sauté the sliced onions until deeply golden brown and caramelized.",
      "Add the garlic and ginger paste and the Fouga spice mix, frying for 2-3 minutes until very fragrant.",
      "Add the chopped tomatoes and cook until they break down to form a rich sauce.",
      "Add enough hot water or fish stock to the pot to make the broth needed to cook the rice, season with salt, and bring to a boil.",
      "Add the drained Basmati rice to the boiling broth. Ensure the liquid level is correct for cooking the rice.",
      "Once the liquid level reduces to the surface of the rice, create a few small holes in the rice.",
      "Drizzle the saffron-infused water over the rice, cover tightly, and steam on very low heat for 15-20 minutes until the rice is cooked and fluffy (*Dum* method).",
      "Gently flake some of the cooked fish and mix it into the rice, reserving the rest of the fillets for presentation.",
      "To serve, place the Fouga rice on a large platter and arrange the whole fried fish fillets on top.",
      "Garnish with fresh chopped parsley and serve hot with a side of chili sauce or yogurt."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Jasheed with Dried Shrimp",
    "imageName": "jasheed_shrimp",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/jasheed_shrimp.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Coastal",
    "isVegetarian": false,
    "healthTags": ["high-protein", "calcium-source"],
    "dietaryTags": ["gluten-free-option"],
    "mealType": "dinner",
    "difficulty": "medium",
    "prepTime": 30,
    "cookTime": 40,
    "spiceLevel": "medium",
    "servings": 4,
    "calories": 550,
    "protein": 35,
    "carbs": 60,
    "fat": 18,
    "allergens": ["shellfish"],
    "cookingMethod": "stovetop-steaming",
    "specialDiet": ["pescatarian"],
    "occasionTags": ["traditional-cuisine", "coastal-specialty"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "2 cups Basmati Rice",
      "200g Dried Shrimp (or small dried fish)",
      "2 large Onions, chopped",
      "2 Tomatoes, chopped",
      "Jasheed Spice Mix (Turmeric, Cumin, Coriander, Dried Limes)",
      "Garlic, Ginger, Green Chilies",
      "Water, Oil, Salt, Fresh Coriander"
    ],
    "requiredIngredients": ["basmati rice", "dried shrimp/fish", "dried limes", "spice mix"],
    "instructions": [
      "Wash the Basmati rice and soak in cold water for 30 minutes. Drain well.",
      "Soak the dried shrimp (or small dried fish) in warm water for 15 minutes to soften, then drain and chop lightly.",
      "In a large pot, heat oil and sauté the chopped onions until softened and golden brown.",
      "Add minced garlic, ginger, and green chilies. Fry for 1-2 minutes until fragrant.",
      "Stir in the Jasheed spice mix and crumbled dried limes. Fry for another minute.",
      "Add the chopped tomatoes and cook until they break down to form a thick sauce.",
      "Add the chopped dried shrimp/fish to the pot. Stir well to combine with the spices and tomatoes.",
      "Pour in enough hot water to just cover the mixture, season lightly with salt, and bring to a simmer.",
      "Add the drained Basmati rice on top of the shrimp mixture. Ensure the water level is appropriate for cooking rice.",
      "Cover the pot tightly and cook on very low heat for 20-25 minutes, or until the rice is cooked and fluffy.",
      "Gently fluff the Jesheed with a fork before serving, mixing the rice and shrimp throughout.",
      "Garnish with fresh coriander and serve hot with a side of yogurt or lemon slices."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Bizza (Emirati Chicken/Lamb Pie)",
    "imageName": "bizza",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/bizza.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": false,
    "healthTags": ["high-protein", "comfort-food"],
    "dietaryTags": [],
    "mealType": "dinner",
    "difficulty": "hard",
    "prepTime": 40,
    "cookTime": 60,
    "spiceLevel": "medium",
    "servings": 6,
    "calories": 650,
    "protein": 35,
    "carbs": 50,
    "fat": 35,
    "allergens": ["gluten", "dairy"],
    "cookingMethod": "baking",
    "specialDiet": [],
    "occasionTags": ["festive-dish", "family-gathering"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "500g Puff Pastry or Shortcrust Pastry",
      "500g Chicken or Lamb, minced/cubed",
      "1 large Onion, chopped",
      "2 Tomatoes, chopped",
      "Emirati Spice Mix (Bzaar, Turmeric, Cumin)",
      "Garlic and Ginger paste",
      "Green Peas, Chopped Carrots",
      "Tomato Paste",
      "Oil/Ghee, Salt, Fresh Coriander"
    ],
    "requiredIngredients": ["puff pastry", "chicken/lamb", "emirati spice mix", "vegetables"],
    "instructions": [
      "Prepare the filling: heat oil/ghee and sauté the chopped onion until softened. Add garlic and ginger paste and fry.",
      "Add the minced meat and brown it thoroughly. Drain off any excess fat.",
      "Stir in the Emirati spice mix, chopped tomatoes, and tomato paste. Cook until the tomatoes break down.",
      "Add the green peas, chopped carrots, and a small amount of water or stock. Simmer for 15-20 minutes until the vegetables are tender and the sauce is thick. Season to taste.",
      "Let the filling cool completely. Cooling is essential to prevent the pastry from becoming soggy.",
      "Preheat the oven to 200°C (400°F). Roll out half of the puff pastry and line a large pie dish.",
      "Spoon the cooled filling evenly into the pastry-lined dish.",
      "Roll out the remaining pastry for the top crust. Cover the pie and crimp the edges to seal.",
      "Brush the top crust with an egg wash (beaten egg) for a golden finish. Cut a small vent hole in the center of the pie.",
      "Bake for 30-40 minutes, or until the pastry is golden brown, puffed up, and crispy.",
      "Let the Bizza rest for 10 minutes before slicing and serving. Serve warm with yogurt or a side salad."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Khuzi (Whole Roasted Lamb)",
    "imageName": "khuzi",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/khuzi.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide/Festive",
    "isVegetarian": false,
    "healthTags": ["high-protein", "iron-rich"],
    "dietaryTags": ["gluten-free"],
    "mealType": "dinner",
    "difficulty": "hard",
    "prepTime": 120,
    "cookTime": 300,
    "spiceLevel": "mild",
    "servings": 10,
    "calories": 850,
    "protein": 50,
    "carbs": 80,
    "fat": 40,
    "allergens": ["nuts-optional"],
    "cookingMethod": "roasting",
    "specialDiet": [],
    "occasionTags": ["weddings", "eid-celebration"],
    "storageType": "refrigerate-leftovers",
    "kidFriendly": true,
    "ingredients": [
      "1 Whole Baby Lamb or Shoulder (8-10kg)",
      "Rice (Basmati, cooked with saffron, nuts, and spices)",
      "Khuzi Rub (Turmeric, Paprika, Bzaar Spice, Salt, Garlic)",
      "Stuffing (Mixed nuts, Raisins, Fried Onions)",
      "Saffron, Rose Water, Ghee",
      "Water/Stock for roasting"
    ],
    "requiredIngredients": ["whole lamb", "basmati rice", "khuzi rub", "nuts/spices"],
    "instructions": [
      "Rinse the lamb thoroughly. Prepare the Khuzi rub by mixing spices, salt, pepper, garlic, and a little olive oil.",
      "Rub the lamb generously, inside and out, with the Khuzi rub. Let it marinate for at least 4 hours, or overnight in the refrigerator.",
      "Pre-cook the Basmati rice with whole spices (cardamom, cinnamon) and saffron. Prepare the stuffing by frying onions, nuts, and raisins.",
      "Stuff the lamb cavity loosely with a portion of the saffron rice and fried stuffing mixture.",
      "Truss the lamb with butcher's twine to hold its shape and keep the stuffing inside.",
      "Preheat the oven to 160°C (325°F). Place the lamb in a large roasting pan on a rack.",
      "Pour a couple of cups of water or stock into the bottom of the pan to keep the oven moist.",
      "Roast the lamb slowly for 4-6 hours, basting occasionally, until the meat is fork-tender and falling off the bone (internal temperature 85-90°C/185-195°F).",
      "During the last hour, increase the temperature slightly to crisp the skin/exterior.",
      "Remove the lamb from the oven and let it rest, covered, for 20-30 minutes before serving.",
      "To serve, spread the remaining saffron rice onto a large platter, place the whole roasted lamb on top, and garnish with remaining nuts and fried onions.",
      "Traditionally, the lamb is also served with a rich tomato gravy on the side."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Batheeth (Date Dessert Paste)",
    "imageName": "batheeth",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/batheeth.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Desert Cuisine",
    "isVegetarian": true,
    "healthTags": ["high-energy", "natural-sweetener"],
    "dietaryTags": ["gluten-free", "dairy-free"],
    "mealType": "dessert-snack",
    "difficulty": "easy",
    "prepTime": 15,
    "cookTime": 15,
    "spiceLevel": "mild",
    "servings": 10,
    "calories": 180,
    "protein": 3,
    "carbs": 30,
    "fat": 5,
    "allergens": ["nuts-optional"],
    "cookingMethod": "stovetop-stirring",
    "specialDiet": ["vegetarian", "vegan"],
    "occasionTags": ["everyday", "ramadan"],
    "storageType": "airtight-container",
    "kidFriendly": true,
    "ingredients": [
      "2 cups Dates (pitted, soft variety preferred)",
      "1 cup Whole Wheat Flour (or specialized Batheeth flour)",
      "1/2 cup Ghee (Clarified Butter)",
      "1/2 tsp Cardamom powder",
      "1/4 tsp Ginger powder (optional)",
      "Sesame seeds or nuts (for garnish/mixing)"
    ],
    "requiredIngredients": ["dates", "flour", "ghee"],
    "instructions": [
      "In a dry pan, gently toast the whole wheat flour over medium-low heat. Stir continuously for 10-15 minutes until the flour turns a light golden color and smells nutty. Do not let it burn.",
      "Remove the toasted flour from the pan and set aside to cool completely.",
      "In the same pan, melt the ghee over low heat.",
      "Add the pitted dates and mash them with the back of a wooden spoon while they cook in the ghee. Cook for 5-7 minutes until the dates are very soft and form a paste.",
      "Stir in the cardamom powder and ginger powder (if using) into the date mixture.",
      "Remove the pan from the heat and gradually add the cooled, toasted flour to the date mixture.",
      "Mix vigorously until the flour is completely incorporated and a thick, uniform paste or dough-like mixture forms.",
      "If the mixture is too dry, add a small amount of extra melted ghee. If too wet, add a little more flour.",
      "Press the Batheeth mixture into a flat layer in a serving dish or mold. Alternatively, roll it into small balls.",
      "Garnish the top with sesame seeds or chopped nuts.",
      "Serve at room temperature with Arabic coffee or tea. Batheeth can be stored in an airtight container for several days."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Madrooba (Salted Fish Porridge)",
    "imageName": "madrooba",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/madrooba.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Coastal",
    "isVegetarian": false,
    "healthTags": ["high-protein", "hearty-meal"],
    "dietaryTags": ["gluten-free-option"],
    "mealType": "dinner",
    "difficulty": "medium",
    "prepTime": 30,
    "cookTime": 90,
    "spiceLevel": "medium",
    "servings": 6,
    "calories": 420,
    "protein": 35,
    "carbs": 40,
    "fat": 15,
    "allergens": ["fish"],
    "cookingMethod": "slow-cooking-mashing",
    "specialDiet": ["pescatarian"],
    "occasionTags": ["ramadan", "traditional-cuisine"],
    "storageType": "refrigerate",
    "kidFriendly": false,
    "ingredients": [
      "500g Salted Fish (Mackerel or Tuna), soaked and cleaned",
      "1 cup Rice (Parboiled or Broken Rice)",
      "2 large Onions, chopped",
      "2 Tomatoes, chopped",
      "Madrooba Spice Mix (Bzaar, Turmeric, Cumin, Dried Limes)",
      "Garlic, Ginger, Green Chilies",
      "Tamarind Paste (for sourness)",
      "Water/Stock, Oil/Ghee, Salt (use sparingly)"
    ],
    "requiredIngredients": ["salted fish", "rice", "spice mix", "tamarind"],
    "instructions": [
      "Soak the salted fish in water overnight, changing the water several times, to draw out excess salt. Clean and cut into pieces.",
      "Wash the rice and soak in cold water for 30 minutes. Drain well.",
      "In a large, heavy pot, heat oil or ghee and sauté the chopped onions until softened. Add garlic, ginger, and chilies. Fry until fragrant.",
      "Stir in the Madrooba spice mix (Bzaar, turmeric, cumin, dried limes) and fry for a minute.",
      "Add the chopped tomatoes and cook until they break down to a thick sauce. Stir in the tamarind paste.",
      "Add the fish and the drained rice to the pot. Add enough hot water or stock to cover the contents by 3-4 inches.",
      "Bring to a boil, then reduce the heat to low, cover tightly, and simmer for 60-90 minutes, or until the rice is overcooked and very soft.",
      "Using a wooden paddle or whisk, vigorously mash the mixture against the sides of the pot (the *madrooba* action) until it becomes a thick, smooth, porridge-like consistency with shredded fish.",
      "Adjust the seasoning. Be cautious with salt, as the fish may still be salty.",
      "Continue simmering for another 10 minutes after mashing to allow the flavors to blend.",
      "Serve hot, typically garnished with a little hot ghee, fried onions, or fresh herbs."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Al-Farih (Yogurt and Bread Dish)",
    "imageName": "al_farih",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/al_farih.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": true,
    "healthTags": ["high-calcium", "probiotic-rich"],
    "dietaryTags": ["vegetarian"],
    "mealType": "breakfast-side-dish",
    "difficulty": "easy",
    "prepTime": 10,
    "cookTime": 10,
    "spiceLevel": "mild",
    "servings": 4,
    "calories": 250,
    "protein": 12,
    "carbs": 30,
    "fat": 8,
    "allergens": ["dairy", "gluten"],
    "cookingMethod": "assembly-light-cook",
    "specialDiet": ["ovo-lacto-vegetarian"],
    "occasionTags": ["everyday", "ramadan-iftar"],
    "storageType": "best-fresh",
    "kidFriendly": true,
    "ingredients": [
      "1 cup Plain Yogurt (or Laban/Buttermilk)",
      "2 pieces Regag Bread or whole wheat flatbread, torn into small pieces",
      "1 large Onion, thinly sliced",
      "1/4 cup Ghee or Butter",
      "Salt and Black Pepper",
      "Turmeric powder (for color)",
      "Dried mint or Parsley (for garnish)"
    ],
    "requiredIngredients": ["yogurt", "flatbread", "onion", "ghee"],
    "instructions": [
      "Tear the Regag bread (or thin flatbread) into bite-sized pieces and place them in the bottom of a serving bowl.",
      "In a small pan, heat the ghee or butter over medium heat.",
      "Add the thinly sliced onion and sauté until golden brown and crispy. This step adds a crucial rich flavor.",
      "Stir in a pinch of salt, black pepper, and turmeric powder to the ghee/onion mixture. Cook for 30 seconds.",
      "Pour the hot ghee and onion mixture directly over the torn bread pieces in the serving bowl. Toss quickly to coat the bread.",
      "In a separate bowl, lightly whisk the plain yogurt (or laban) with a pinch of salt until smooth and slightly runny.",
      "Pour the yogurt mixture generously over the ghee-coated bread.",
      "The warm bread should slightly soften and absorb the flavor of the ghee and yogurt.",
      "Garnish the top of the dish with dried mint, fresh parsley, or a dash of paprika.",
      "Serve Al-Farih immediately while the bread is still slightly warm, offering a unique blend of cool, tangy, and savory flavors.",
      "Traditionally served as a light start to the day or after sunset during Ramadan."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Baleelah (Sweet Chickpea Bowl)",
    "imageName": "baleelah",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/baleelah.png",
    "cuisine": "Middle Eastern/Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": true,
    "healthTags": ["high-fiber", "plant-protein"],
    "dietaryTags": ["gluten-free", "vegan"],
    "mealType": "dessert-snack",
    "difficulty": "easy",
    "prepTime": 10,
    "cookTime": 10,
    "spiceLevel": "mild",
    "servings": 4,
    "calories": 200,
    "protein": 8,
    "carbs": 35,
    "fat": 3,
    "allergens": [],
    "cookingMethod": "stovetop-simmering",
    "specialDiet": ["vegetarian", "vegan"],
    "occasionTags": ["ramadan-iftar", "street-food"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "2 cups Chickpeas (canned or cooked from dry)",
      "1/2 cup Sugar (or Dibbs/Honey)",
      "1/2 tsp Cardamom powder",
      "1/4 tsp Saffron threads",
      "Rose Water (optional)",
      "Lemon or Orange Blossom Water (optional)",
      "Water"
    ],
    "requiredIngredients": ["chickpeas", "sugar", "cardamom"],
    "instructions": [
      "If using dried chickpeas, soak them overnight and cook until very tender. If using canned, rinse and drain well.",
      "In a medium pot, combine the chickpeas with enough water to cover them by about 2 inches.",
      "Add the sugar (or date syrup/honey), cardamom powder, and saffron threads to the water.",
      "Bring the mixture to a slow boil, stirring until the sugar is fully dissolved.",
      "Reduce the heat and simmer gently for 10-15 minutes, allowing the chickpeas to absorb the sweet, aromatic syrup.",
      "Stir in a splash of rose water or lemon/orange blossom water, if desired, for an extra aromatic flavor.",
      "Remove the pot from the heat and let the Baleelah cool slightly, or serve warm.",
      "To serve, spoon the chickpeas into small bowls with a generous amount of the sweet syrup.",
      "Baleelah is traditionally served warm but can also be enjoyed cold.",
      "Garnish with a sprinkle of crushed nuts or a drizzle of extra date syrup (Dibbs)."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Jabāb Bread (Emirati Pancakes)",
    "imageName": "jabab_bread",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/jabab_bread.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": true,
    "healthTags": ["breakfast", "comfort-food"],
    "dietaryTags": ["ovo-lacto-vegetarian"],
    "mealType": "breakfast-snack",
    "difficulty": "easy",
    "prepTime": 60,
    "cookTime": 15,
    "spiceLevel": "mild",
    "servings": 4,
    "calories": 280,
    "protein": 10,
    "carbs": 40,
    "fat": 8,
    "allergens": ["gluten", "eggs", "dairy-optional"],
    "cookingMethod": "stovetop-griddle",
    "specialDiet": ["vegetarian"],
    "occasionTags": ["everyday", "ramadan-suhoor"],
    "storageType": "best-fresh",
    "kidFriendly": true,
    "ingredients": [
      "2 cups All-Purpose Flour",
      "1 cup Warm Milk (or water)",
      "1 Egg",
      "1 Tbsp Yeast",
      "1 Tbsp Sugar",
      "1/2 tsp Cardamom powder",
      "1/4 tsp Saffron threads",
      "Pinch of Salt",
      "Ghee/Butter for cooking",
      "Honey or Date Syrup (Dibbs) for serving"
    ],
    "requiredIngredients": ["flour", "milk/water", "egg", "yeast", "cardamom"],
    "instructions": [
      "In a small bowl, dissolve the yeast and a pinch of sugar in warm milk/water. Let it sit for 5-10 minutes until foamy.",
      "In a large bowl, whisk together the flour, the remaining sugar, salt, and cardamom powder.",
      "Add the egg and the yeast mixture to the dry ingredients. Whisk until a smooth, runny pancake-like batter forms.",
      "Stir in the saffron threads and let the batter rest and rise in a warm place for 45-60 minutes.",
      "Heat a non-stick griddle or flat pan over medium heat. Lightly grease with ghee or butter.",
      "Pour 1/4 cup of the batter onto the hot griddle to form a medium-sized pancake.",
      "Cook for 2-3 minutes until bubbles appear on the surface and the edges set.",
      "Flip the bread/pancake and cook the other side until lightly golden brown.",
      "Cook all the Jabāb breads in batches, stacking them to keep them warm.",
      "Serve the warm Jabāb Bread immediately, drizzled generously with local honey or date syrup (Dibbs).",
      "It is often served with cream cheese, savory dips, or alongside tea/coffee."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Sambuusa (Savory Pastries)",
    "imageName": "sambuusa",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/sambuusa.png",
    "cuisine": "Middle Eastern/Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": false,
    "healthTags": ["quick-protein", "snack"],
    "dietaryTags": [],
    "mealType": "appetizer-snack",
    "difficulty": "medium",
    "prepTime": 30,
    "cookTime": 20,
    "spiceLevel": "medium",
    "servings": 12,
    "calories": 150,
    "protein": 7,
    "carbs": 15,
    "fat": 7,
    "allergens": ["gluten", "dairy-optional"],
    "cookingMethod": "deep-fry-baking",
    "specialDiet": ["vegetarian-option"],
    "occasionTags": ["ramadan-iftar", "party-food"],
    "storageType": "freezable-raw",
    "kidFriendly": true,
    "ingredients": [
      "Sambuusa pastry sheets (thin dough wrappers)",
      "Filling (Minced Lamb/Beef/Chicken, Potatoes, Peas, Onions)",
      "Spice Mix (Cumin, Coriander, Turmeric, Chili)",
      "Garlic, Ginger, Fresh Herbs",
      "Oil for frying/baking"
    ],
    "requiredIngredients": ["pastry sheets", "minced meat", "onions", "spice mix"],
    "instructions": [
      "Prepare the filling: brown the minced meat in a pan. Drain any fat.",
      "Add chopped onions, garlic, and ginger. Sauté until fragrant.",
      "Stir in the spice mix (cumin, coriander, turmeric, chili) and cook for 2 minutes.",
      "Add diced potatoes and peas, and a small amount of water. Cover and simmer until the potatoes are tender and the liquid is absorbed.",
      "Season the filling well with salt and fresh herbs (coriander). Let the filling cool completely.",
      "Take a sambuusa sheet (or pastry wrapper) and place a spoonful of the cooled filling near one corner.",
      "Fold the sheet into a triangular pocket, ensuring the filling is enclosed.",
      "Seal the edges tightly with a little water or flour paste.",
      "Fry the sambuusa in preheated oil (170°C/340°F) for 3-5 minutes until golden brown and crispy.",
      "Alternatively, brush with oil and bake at 200°C (400°F) until golden (about 15 minutes).",
      "Serve the Sambuusa hot with a dipping sauce, such as a tangy tomato chutney or chili sauce."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Muhammar (Sweet Saffron Rice)",
    "imageName": "muhammar",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/muhammar.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Coastal",
    "isVegetarian": true,
    "healthTags": ["complex-carbs", "sweet-savory"],
    "dietaryTags": ["gluten-free-option"],
    "mealType": "side-dish-dessert",
    "difficulty": "medium",
    "prepTime": 20,
    "cookTime": 40,
    "spiceLevel": "mild",
    "servings": 6,
    "calories": 350,
    "protein": 5,
    "carbs": 60,
    "fat": 10,
    "allergens": ["dairy-optional"],
    "cookingMethod": "stovetop-steaming",
    "specialDiet": ["vegetarian"],
    "occasionTags": ["festive-dish", "seafood-accompaniment"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "2 cups Basmati Rice",
      "1/2 cup Sugar or Molasses (Dibbs)",
      "1/2 cup Water",
      "1/2 tsp Saffron threads, soaked in warm water",
      "1/2 tsp Cardamom powder",
      "2 Tbsp Ghee or Butter",
      "Chopped Nuts (for garnish, optional)"
    ],
    "requiredIngredients": ["basmati rice", "sugar/molasses", "saffron", "cardamom"],
    "instructions": [
      "Wash the Basmati rice thoroughly and soak it in cold water for 30 minutes. Drain well.",
      "In a small saucepan, combine the sugar (or molasses) and 1/2 cup of water. Heat gently, stirring until the sugar is dissolved, creating a light syrup. Set aside.",
      "In a medium pot, bring 4-5 cups of water to a boil. Add the drained rice and cook until it is about 75% done (parboiled). Drain the rice well.",
      "In the same pot, melt the ghee or butter over low heat. Add the cardamom powder and saffron-infused water, stirring quickly.",
      "Add the partially cooked rice to the pot. Gently pour the prepared sugar syrup over the rice.",
      "Cover the pot tightly with a lid (or foil and a lid) and cook on the lowest heat setting for 20-25 minutes, allowing the rice to steam and absorb the sweet syrup completely (*Dum* method).",
      "Do not stir during the steaming process. The rice should develop a deep, reddish-brown color on the bottom.",
      "Remove the pot from the heat and let it sit, covered, for 10 minutes.",
      "Gently fluff the rice with a fork, mixing the sweet, caramelized bottom layers with the fluffier top.",
      "Serve the Muhammar warm as a sweet side dish, traditionally paired with grilled or salted fish (like Jesheed), or garnished with chopped nuts."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Sago Pudding (Khanfaroosh Style)",
    "imageName": "sago_pudding",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/sago_pudding.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": true,
    "healthTags": ["cooling", "dessert"],
    "dietaryTags": ["gluten-free", "dairy-free"],
    "mealType": "dessert",
    "difficulty": "medium",
    "prepTime": 20,
    "cookTime": 30,
    "spiceLevel": "mild",
    "servings": 6,
    "calories": 250,
    "protein": 2,
    "carbs": 50,
    "fat": 5,
    "allergens": [],
    "cookingMethod": "stovetop-simmering",
    "specialDiet": ["vegetarian", "vegan"],
    "occasionTags": ["ramadan-iftar", "tea-time"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "1 cup Sago Pearls",
      "4 cups Water or Milk (Coconut Milk for vegan)",
      "1/2 cup Sugar (or Dibbs/Honey)",
      "1/2 tsp Cardamom powder",
      "Saffron threads, soaked in warm water",
      "Rose Water",
      "Pistachios/Almonds (for garnish)"
    ],
    "requiredIngredients": ["sago pearls", "water/milk", "sugar", "cardamom", "saffron"],
    "instructions": [
      "Wash the sago pearls thoroughly. Soak the sago pearls in water for 15-30 minutes, then drain.",
      "In a medium pot, combine the sago with the 4 cups of water or milk (or coconut milk).",
      "Bring the mixture to a boil over medium heat, stirring constantly to prevent the sago from sticking to the bottom.",
      "Once boiling, reduce the heat to low and simmer for 15-20 minutes, stirring frequently until the sago pearls become translucent.",
      "Add the sugar, cardamom powder, saffron-infused water, and a splash of rose water.",
      "Stir the pudding well until the sugar is completely dissolved and the pudding has reached a thick, glossy consistency.",
      "Taste and adjust the sweetness and cardamom level as needed.",
      "Pour the hot Sago pudding into individual serving bowls or a large platter.",
      "Allow the pudding to cool slightly at room temperature, then transfer to the refrigerator and chill for at least 2 hours to set.",
      "Before serving, drizzle with date syrup (Dibbs) or garnish generously with chopped nuts and fresh fruit.",
      "Serve chilled as a light, sweet, and aromatic dessert."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Sikkam (Lamb and Bread Dish)",
    "imageName": "sikkam",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/sikkam.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": false,
    "healthTags": ["high-protein", "hearty-meal"],
    "dietaryTags": ["dairy-free"],
    "mealType": "dinner",
    "difficulty": "medium",
    "prepTime": 30,
    "cookTime": 90,
    "spiceLevel": "mild",
    "servings": 6,
    "calories": 600,
    "protein": 40,
    "carbs": 50,
    "fat": 30,
    "allergens": ["gluten"],
    "cookingMethod": "stovetop-simmering",
    "specialDiet": [],
    "occasionTags": ["festive-dish", "ramadan"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "750g Lamb or Goat Meat, cubed",
      "2 large Onions, chopped",
      "2 Tomatoes, chopped",
      "Emirati Bzaar Spice Mix (Baharat, Turmeric, Dried Limes)",
      "Garlic, Ginger, Green Chilies",
      "Water/Stock, Oil/Ghee, Salt",
      "Traditional bread (Regag or Khameer), torn"
    ],
    "requiredIngredients": ["lamb/goat", "bzaar spice", "tomato", "bread"],
    "instructions": [
      "In a large pot, heat oil or ghee and brown the lamb/goat meat cubes thoroughly on all sides. Remove and set aside.",
      "In the same pot, sauté the chopped onions until softened. Add garlic and ginger, frying for another minute.",
      "Stir in the Emirati Bzaar spice mix, a little turmeric, and green chilies. Fry for a minute until fragrant.",
      "Add the chopped tomatoes. Cook until they break down to form a thick sauce.",
      "Return the browned meat to the pot. Add enough hot water or stock to cover the meat. Season with salt and add dried limes.",
      "Bring to a boil, then reduce heat, cover, and simmer for 60-90 minutes until the meat is very tender and falling apart.",
      "Prepare the bread: tear the traditional Regag or Khameer bread into medium-sized, rustic pieces and place them in the bottom of a large serving dish.",
      "Once the meat is tender, remove some of the lamb from the stew and shred it lightly. Return the shredded meat to the pot.",
      "Gently thicken the remaining stew sauce using a whisk or by reducing it slightly on higher heat.",
      "Ladle the hot, rich lamb stew generously over the torn bread pieces, allowing the bread to soak up all the broth.",
      "Serve the Sikkam immediately while the stew is piping hot and the bread is moist and flavorful."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Shorbat Adas (Lentil Soup)",
    "imageName": "shorbat_adas",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/shorbat_adas.png",
    "cuisine": "Middle Eastern/Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": true,
    "healthTags": ["high-fiber", "plant-protein", "iron-rich"],
    "dietaryTags": ["gluten-free", "vegan"],
    "mealType": "appetizer-soup",
    "difficulty": "easy",
    "prepTime": 15,
    "cookTime": 30,
    "spiceLevel": "mild",
    "servings": 6,
    "calories": 180,
    "protein": 10,
    "carbs": 30,
    "fat": 3,
    "allergens": [],
    "cookingMethod": "stovetop-simmering",
    "specialDiet": ["vegetarian", "vegan"],
    "occasionTags": ["ramadan-iftar", "comfort-food"],
    "storageType": "freezable",
    "kidFriendly": true,
    "ingredients": [
      "1 cup Red Lentils (Adas), rinsed",
      "1 large Onion, chopped",
      "2 Carrots, diced",
      "2 Potatoes, diced",
      "4 cups Vegetable or Chicken Stock",
      "Cumin, Turmeric, Salt, Black Pepper",
      "Olive Oil/Ghee",
      "Lemon wedges, fresh Parsley (for garnish)"
    ],
    "requiredIngredients": ["red lentils", "onion", "carrots", "cumin"],
    "instructions": [
      "Wash the red lentils until the water runs clear; set aside.",
      "In a large pot, heat olive oil or ghee and sauté the chopped onion until softened (about 5 minutes).",
      "Add the diced carrots and potatoes to the pot. Cook for another 5 minutes, stirring occasionally.",
      "Stir in the spices: cumin, turmeric, salt, and black pepper. Cook for 1 minute until fragrant.",
      "Add the washed lentils and the vegetable or chicken stock to the pot.",
      "Bring the soup to a boil, then immediately reduce the heat to low. Cover and simmer for 20-25 minutes.",
      "Cook until the lentils are completely soft and mushy, and the vegetables are tender.",
      "Remove the pot from the heat. Use an immersion blender or transfer the soup to a regular blender and blend until completely smooth and creamy.",
      "Return the soup to the pot, taste, and adjust the seasoning (salt and pepper) if necessary. Add a little hot water if the soup is too thick.",
      "Serve the Shorbat Adas piping hot in bowls.",
      "Garnish with a drizzle of olive oil, a sprinkle of fresh chopped parsley, and a lemon wedge for acidity."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Fattoush (Pita Bread Salad)",
    "imageName": "fattoush",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/fattoush.png",
    "cuisine": "Middle Eastern/Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": true,
    "healthTags": ["high-fiber", "fresh-vegetables"],
    "dietaryTags": ["vegan-option"],
    "mealType": "side-dish-salad",
    "difficulty": "easy",
    "prepTime": 20,
    "cookTime": 5,
    "spiceLevel": "mild",
    "servings": 4,
    "calories": 250,
    "protein": 5,
    "carbs": 30,
    "fat": 12,
    "allergens": ["gluten"],
    "cookingMethod": "frying-assembly",
    "specialDiet": ["vegetarian", "vegan"],
    "occasionTags": ["ramadan-iftar", "everyday"],
    "storageType": "best-fresh",
    "kidFriendly": true,
    "ingredients": [
      "2 Large Pita Breads",
      "Mixed Greens (Romaine, Parsley, Mint)",
      "Cucumber, Tomatoes, Radishes, Bell Peppers",
      "Dressing (Olive Oil, Lemon Juice, Sumac, Pomegranate Molasses)",
      "Garlic, Salt, Black Pepper"
    ],
    "requiredIngredients": ["pita bread", "mixed greens", "lemon juice", "sumac"],
    "instructions": [
      "Prepare the pita chips: brush the pita bread with olive oil, cut into triangles, and bake or fry until crispy and golden brown. Set aside.",
      "Wash and chop all the fresh vegetables (cucumber, tomatoes, radishes, bell peppers) into bite-sized pieces.",
      "Roughly chop the mixed fresh herbs, including a generous amount of parsley and mint.",
      "Combine all the chopped vegetables and fresh herbs in a large salad bowl.",
      "Prepare the dressing: in a small bowl, whisk together the olive oil, fresh lemon juice, crushed garlic, salt, and black pepper.",
      "Add the signature flavor components: a generous amount of Sumac powder and a drizzle of Pomegranate Molasses to the dressing.",
      "Taste the dressing and adjust the sweet/sour balance as needed. It should be tangy and rich.",
      "Just before serving, pour the dressing over the vegetables in the salad bowl.",
      "Toss the salad gently to ensure all the vegetables are coated with the dressing.",
      "Add the crispy pita chips on top of the salad (do not mix until serving to maintain crunch).",
      "Serve immediately as a refreshing and savory appetizer or side dish."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Margooga (Thin Bread and Vegetable Stew)",
    "imageName": "margooga",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/margooga.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": false,
    "healthTags": ["high-fiber", "nutrient-dense"],
    "dietaryTags": ["dairy-free"],
    "mealType": "dinner",
    "difficulty": "medium",
    "prepTime": 30,
    "cookTime": 90,
    "spiceLevel": "mild",
    "servings": 6,
    "calories": 550,
    "protein": 30,
    "carbs": 50,
    "fat": 25,
    "allergens": ["gluten"],
    "cookingMethod": "stovetop-simmering",
    "specialDiet": [],
    "occasionTags": ["comfort-food", "ramadan"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "750g Lamb or Chicken, cubed",
      "Mixed Vegetables (Potatoes, Carrots, Zucchini, Pumpkin)",
      "2 large Onions, chopped",
      "2 Tomatoes, chopped",
      "Emirati Bzaar Spice Mix, Turmeric",
      "Tomato Paste",
      "Garlic, Ginger, Dried Limes",
      "Water/Stock, Oil/Ghee, Salt",
      "Flatbread Dough (made from whole wheat flour)"
    ],
    "requiredIngredients": ["lamb/chicken", "bzaar spice", "mixed vegetables", "flatbread dough"],
    "instructions": [
      "Prepare a simple, slightly stiff dough from whole wheat flour, water, and salt. Divide it into small balls, flatten, and set aside.",
      "In a large pot, brown the meat cubes in oil/ghee. Remove and set aside.",
      "Sauté the chopped onions until softened. Add garlic and ginger, followed by the Bzaar spice mix, turmeric, and dried limes. Fry for 2 minutes.",
      "Add the chopped tomatoes and tomato paste. Cook until the tomatoes break down completely.",
      "Return the browned meat to the pot. Add enough hot water or stock, season with salt, and bring to a boil. Simmer for 60-90 minutes until the meat is tender.",
      "Add the hard vegetables (potatoes, carrots, pumpkin) to the stew. Simmer for 15 minutes.",
      "Roll the small dough balls very thinly. Tear the thin dough into rustic 2-inch pieces and drop them one by one into the simmering stew.",
      "Add the softer vegetables (zucchini). Cover and simmer for another 15-20 minutes.",
      "The dough pieces will cook and swell, absorbing the rich stew flavor and thickening the gravy.",
      "Adjust seasoning as needed. The final dish should be thick, hearty, and intensely flavorful.",
      "Serve the Margooga hot as a complete, comforting meal in a communal dish."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Batheeth Tamer (Date Energy Bars)",
    "imageName": "batheeth_tamer",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/batheeth_tamer.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Desert Cuisine",
    "isVegetarian": true,
    "healthTags": ["high-energy", "natural-sweetener"],
    "dietaryTags": ["gluten-free", "dairy-free"],
    "mealType": "dessert-snack",
    "difficulty": "easy",
    "prepTime": 15,
    "cookTime": 15,
    "spiceLevel": "mild",
    "servings": 12,
    "calories": 160,
    "protein": 3,
    "carbs": 25,
    "fat": 5,
    "allergens": ["nuts-optional"],
    "cookingMethod": "stovetop-stirring",
    "specialDiet": ["vegetarian", "vegan"],
    "occasionTags": ["everyday", "ramadan-suhoor"],
    "storageType": "airtight-container",
    "kidFriendly": true,
    "ingredients": [
      "2 cups Soft Pitted Dates",
      "1 cup Whole Wheat Flour (or alternative flour)",
      "1/2 cup Ghee (Clarified Butter)",
      "1/2 tsp Cardamom powder",
      "1/4 tsp Ginger powder",
      "Sesame seeds, Chopped Pistachios (for garnish/mixing)"
    ],
    "requiredIngredients": ["dates", "flour", "ghee", "cardamom"],
    "instructions": [
      "Toast the whole wheat flour in a dry pan over medium-low heat. Stir continuously for 10-15 minutes until it turns a light golden color and smells nutty. Cool the flour completely.",
      "Melt the ghee in a large pot over low heat.",
      "Add the pitted dates and mash them with a wooden spoon as they cook in the ghee. Cook for 5-7 minutes until the dates form a smooth paste.",
      "Stir in the cardamom powder and ginger powder into the date mixture.",
      "Remove the pot from the heat and gradually add the cooled, toasted flour to the date mixture.",
      "Mix vigorously until the flour is completely incorporated and a thick, uniform paste or dough forms.",
      "If the mixture is too dry, add a small amount of extra melted ghee. If too wet, add a little more flour.",
      "Press the Batheeth mixture into a flat layer in a serving dish or mold, or roll it into small balls.",
      "If desired, mix in some chopped pistachios or sesame seeds before rolling.",
      "Garnish the top with remaining sesame seeds or chopped nuts.",
      "Serve at room temperature. Batheeth Tamer can be stored in an airtight container for several days."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Mutabbaq (Stuffed Savory Pancake)",
    "imageName": "mutabbaq",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/mutabbaq.png",
    "cuisine": "Middle Eastern/Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": false,
    "healthTags": ["high-protein", "comfort-food"],
    "dietaryTags": [],
    "mealType": "dinner-snack",
    "difficulty": "medium",
    "prepTime": 25,
    "cookTime": 15,
    "spiceLevel": "medium",
    "servings": 4,
    "calories": 580,
    "protein": 30,
    "carbs": 45,
    "fat": 30,
    "allergens": ["gluten", "eggs"],
    "cookingMethod": "stovetop-pan-fry",
    "specialDiet": [],
    "occasionTags": ["ramadan-iftar", "street-food"],
    "storageType": "best-fresh",
    "kidFriendly": true,
    "ingredients": [
      "Mutabbaq Dough (thin pastry dough, often bought ready-made)",
      "Filling (Minced Lamb/Beef, Egg, Chopped Leeks/Spring Onion, Onion)",
      "Cumin, Coriander, Chili Powder",
      "Oil for frying",
      "Lemon wedges, Yogurt or Chutney (for serving)"
    ],
    "requiredIngredients": ["mutabbaq dough", "minced meat", "egg", "spices"],
    "instructions": [
      "Prepare the filling: brown the minced meat (lamb or beef) in a pan. Drain any fat.",
      "In a bowl, combine the cooked minced meat, chopped onions, leeks/spring onions, beaten egg, salt, pepper, cumin, coriander, and chili powder.",
      "Mix the filling thoroughly. The egg should lightly bind the mixture but should not be scrambled beforehand.",
      "Lay a thin sheet of Mutabbaq dough flat on a working surface.",
      "Spread a layer of the raw egg-meat filling mixture evenly across the center of the sheet, leaving a wide border.",
      "Carefully fold the edges of the dough over the filling to create a square or rectangular pocket, sealing the filling inside.",
      "Heat a large, non-stick pan or griddle with a small amount of oil or ghee over medium heat.",
      "Place the Mutabbaq pocket seam-side down on the hot pan.",
      "Pan-fry the Mutabbaq for 5-7 minutes per side, pressing lightly, until both sides are golden brown, crispy, and the meat/egg filling is fully cooked.",
      "Remove from the pan and slice the Mutabbaq into squares or triangles.",
      "Serve the Mutabbaq immediately while hot, accompanied by fresh lemon wedges (to squeeze over) and a tangy side of chutney or yogurt."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Dango (Savory Chickpeas)",
    "imageName": "dango",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/dango.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": true,
    "healthTags": ["plant-protein", "high-fiber"],
    "dietaryTags": ["gluten-free", "vegan"],
    "mealType": "snack-side-dish",
    "difficulty": "easy",
    "prepTime": 10,
    "cookTime": 90,
    "spiceLevel": "mild",
    "servings": 6,
    "calories": 150,
    "protein": 7,
    "carbs": 25,
    "fat": 2,
    "allergens": [],
    "cookingMethod": "stovetop-simmering",
    "specialDiet": ["vegetarian", "vegan"],
    "occasionTags": ["street-food", "ramadan-iftar"],
    "storageType": "refrigerate-brine",
    "kidFriendly": true,
    "ingredients": [
      "2 cups Dried Chickpeas (Nakhut)",
      "Water",
      "Salt to taste",
      "Cumin powder (optional)",
      "Chili powder (optional)",
      "Lemon juice (for serving)"
    ],
    "requiredIngredients": ["dried chickpeas", "salt", "water"],
    "instructions": [
      "Wash the dried chickpeas thoroughly. Soak them in plenty of cold water for at least 8-12 hours, or overnight.",
      "Drain the soaking water and rinse the chickpeas well.",
      "Place the chickpeas in a large pot and cover them with fresh water. Add 1/2 teaspoon of salt.",
      "Bring the water to a boil over high heat, skimming off any foam that rises to the surface.",
      "Reduce the heat to low, cover the pot, and simmer the chickpeas for 1.5 to 2 hours.",
      "Cook until the chickpeas are very tender and soft. The texture should be pleasant to chew, not hard or chalky.",
      "Once cooked, season generously with salt to taste. You can also add a small amount of cumin powder to the cooking water for extra flavor.",
      "The chickpeas are traditionally served in their warm, salty cooking liquid.",
      "To serve, ladle the Dango (chickpeas and broth) into small bowls.",
      "Garnish with a squeeze of fresh lemon juice, and a sprinkle of cumin and chili powder (for those who prefer spice).",
      "Dango is a simple, satisfying snack and street food, often served warm."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Jami (Sweet Yogurt Cheese)",
    "imageName": "jami",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/jami.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Bedouin",
    "isVegetarian": true,
    "healthTags": ["high-calcium", "high-protein"],
    "dietaryTags": ["gluten-free", "vegetarian"],
    "mealType": "breakfast-side-dish",
    "difficulty": "hard",
    "prepTime": 120,
    "cookTime": 60,
    "spiceLevel": "mild",
    "servings": 8,
    "calories": 200,
    "protein": 15,
    "carbs": 10,
    "fat": 10,
    "allergens": ["dairy"],
    "cookingMethod": "boiling-drying",
    "specialDiet": ["ovo-lacto-vegetarian"],
    "occasionTags": ["traditional-cuisine", "everyday"],
    "storageType": "refrigerate-dry",
    "kidFriendly": true,
    "ingredients": [
      "1 Liter Buttermilk (Laban)",
      "1 Liter Full-Fat Yogurt",
      "2 Tbsp Lemon Juice or Vinegar (for curdling)",
      "Salt (for the cheese)",
      "Sugar or Date Syrup (Dibbs) for serving"
    ],
    "requiredIngredients": ["yogurt/buttermilk", "lemon/vinegar", "salt"],
    "instructions": [
      "Combine the buttermilk (Laban) and full-fat yogurt in a large pot. Bring the mixture to a gentle boil over low to medium heat.",
      "Stir occasionally. As the mixture heats, add the lemon juice or vinegar. This curdles the mixture, separating the curds (solids) from the whey (liquid).",
      "Continue simmering for 30-40 minutes until the curds have fully separated and collected at the top.",
      "Remove the pot from the heat and allow it to cool slightly.",
      "Line a colander with cheesecloth (muslin cloth) and ladle the curds and whey into the cloth-lined colander.",
      "Tie the corners of the cheesecloth together and hang the bundle over a bowl to allow the whey to drain completely (takes 1-2 hours).",
      "Once drained, unwrap the curds. You should have a soft, fresh cheese (similar to ricotta or cottage cheese). Season the fresh cheese with a little salt.",
      "For a drier, longer-lasting Jami, break the curds into small pieces and lay them on a tray to air-dry in a cool, ventilated place for several hours or in a very low oven until firm.",
      "Jami is traditionally served fresh or dried. Serve the fresh, soft Jami with a drizzle of date syrup or honey.",
      "It is commonly eaten with Khameer bread or dates for breakfast."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Mahala (Sweet Thin Crepes)",
    "imageName": "mahala",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/mahala.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": true,
    "healthTags": ["breakfast", "sweet-snack"],
    "dietaryTags": ["ovo-lacto-vegetarian"],
    "mealType": "breakfast-dessert",
    "difficulty": "easy",
    "prepTime": 15,
    "cookTime": 15,
    "spiceLevel": "mild",
    "servings": 4,
    "calories": 200,
    "protein": 8,
    "carbs": 30,
    "fat": 5,
    "allergens": ["gluten", "eggs", "dairy"],
    "cookingMethod": "stovetop-pan-fry",
    "specialDiet": ["vegetarian"],
    "occasionTags": ["everyday", "tea-time"],
    "storageType": "best-fresh",
    "kidFriendly": true,
    "ingredients": [
      "1 cup All-Purpose Flour",
      "1 cup Milk or Buttermilk (Laban)",
      "1 Egg",
      "1/4 cup Sugar",
      "Pinch of Saffron threads, soaked in warm water",
      "1/2 tsp Cardamom powder",
      "Ghee or Butter for cooking",
      "Date Syrup (Dibbs) or Honey for serving"
    ],
    "requiredIngredients": ["flour", "milk/buttermilk", "egg", "saffron", "cardamom"],
    "instructions": [
      "In a large bowl, whisk together the flour, sugar, cardamom powder, and salt.",
      "In a separate bowl, whisk the egg, milk (or buttermilk), and the saffron-infused water/milk.",
      "Gradually add the wet ingredients to the dry ingredients, whisking continuously until a smooth, thin batter forms (similar to crepe batter).",
      "Let the batter rest at room temperature for 15 minutes.",
      "Heat a non-stick pan or griddle over medium heat. Lightly grease the pan with a little ghee or butter.",
      "Pour a small amount of batter onto the pan, swirling it quickly to coat the bottom thinly (like making a French crepe).",
      "Cook for 1-2 minutes until the edges turn golden and the surface is set.",
      "Flip the Mahala crepe and cook the other side for about 30 seconds until lightly golden.",
      "Cook all the crepes in batches, stacking them on a plate to keep them warm.",
      "Serve the Mahala crepes warm, folded or rolled, drizzled generously with date syrup (Dibbs) or honey.",
      "Mahala is a simple, aromatic, and comforting bread/pancake often served at breakfast or with tea."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Baleelah Salad (Spiced Chickpeas)",
    "imageName": "baleelah_salad",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/baleelah_salad.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": true,
    "healthTags": ["plant-protein", "high-fiber", "low-fat"],
    "dietaryTags": ["gluten-free", "vegan"],
    "mealType": "side-dish-appetizer",
    "difficulty": "easy",
    "prepTime": 15,
    "cookTime": 10,
    "spiceLevel": "medium",
    "servings": 4,
    "calories": 200,
    "protein": 8,
    "carbs": 30,
    "fat": 5,
    "allergens": [],
    "cookingMethod": "assembly-light-cook",
    "specialDiet": ["vegetarian", "vegan"],
    "occasionTags": ["ramadan-iftar", "everyday"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "2 cups Chickpeas (cooked and drained)",
      "1/4 cup Olive Oil",
      "1/4 cup Lemon Juice",
      "2 cloves Garlic, minced",
      "Cumin powder, Paprika, Salt, Pepper",
      "Chopped Parsley and Mint",
      "Pinch of Chili Flakes (optional)"
    ],
    "requiredIngredients": ["chickpeas", "lemon juice", "olive oil", "cumin"],
    "instructions": [
      "If using canned chickpeas, drain and rinse thoroughly. If cooking from dry, ensure they are very tender.",
      "In a small pot, warm the chickpeas gently in a little water or stock. They should be warm, not boiling.",
      "While the chickpeas warm, prepare the dressing: in a bowl, whisk together the olive oil, fresh lemon juice, and minced garlic.",
      "Stir in the spices: cumin powder, paprika, salt, pepper, and chili flakes (if using). Taste and adjust seasoning.",
      "Drain the warm chickpeas and place them in a serving bowl.",
      "Pour the prepared dressing generously over the warm chickpeas. Toss gently to coat them evenly.",
      "The warmth of the chickpeas helps them absorb the flavors of the dressing.",
      "Stir in the freshly chopped parsley and mint.",
      "Serve the Baleelah Salad warm as a tangy, savory side dish.",
      "This simple preparation of Baleelah is often used as a savory contrast to the sweeter versions."
    ],
    "youtubeUrl": ""
  },

  {
    "name": "Aysh Abu Laham (Meat Rice Pudding)",
    "imageName": "aysh_abu_laham",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/aysh_abu_laham.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Traditional",
    "isVegetarian": false,
    "healthTags": ["hearty-meal", "high-protein"],
    "dietaryTags": ["dairy-free-option"],
    "mealType": "dinner",
    "difficulty": "medium",
    "prepTime": 20,
    "cookTime": 90,
    "spiceLevel": "mild",
    "servings": 6,
    "calories": 650,
    "protein": 40,
    "carbs": 55,
    "fat": 30,
    "allergens": [],
    "cookingMethod": "stovetop-simmering",
    "specialDiet": [],
    "occasionTags": ["festive-dish", "family-gathering"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "500g Lamb or Beef (tender cuts), cubed",
      "1 cup Short-grain Rice (Egyptian or similar)",
      "2 large Onions, finely chopped",
      "Ghee or Oil",
      "Dried Limes (Loomi), crushed",
      "Emirati Bzaar Spice Mix, Turmeric",
      "Water/Stock, Salt"
    ],
    "requiredIngredients": ["lamb/beef", "short-grain rice", "dried limes", "bzaar spice"],
    "instructions": [
      "Wash the rice and set aside. In a heavy-bottomed pot, heat the ghee or oil and brown the lamb/beef cubes thoroughly.",
      "Remove the meat and set aside. In the same pot, sauté the finely chopped onions until softened and caramelized.",
      "Add the Emirati Bzaar spice mix, turmeric, and crushed dried limes. Fry for 1-2 minutes until fragrant.",
      "Return the meat to the pot. Add enough hot water or stock to cover the meat, season with salt, and bring to a boil.",
      "Reduce heat, cover, and simmer for 60-90 minutes until the meat is very tender.",
      "Add the washed, uncooked short-grain rice to the stew. Ensure there is enough liquid; the consistency should be soupy initially.",
      "Simmer gently for 20-30 minutes, stirring occasionally, until the rice has broken down and created a thick, creamy porridge with the meat.",
      "If the consistency is too thick, add small amounts of hot water until the desired thickness is reached.",
      "Remove any large pieces of dried lime before serving.",
      "Season generously with salt to taste. The dish should be savory and comforting.",
      "Serve the Aysh Abu Laham hot, traditionally topped with extra melted ghee or fried onions."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Khabeesa (Sweet Toasted Flour Pudding)",
    "imageName": "khabeesa",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/khabeesa.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Traditional",
    "isVegetarian": true,
    "healthTags": ["high-energy", "dessert"],
    "dietaryTags": ["ovo-lacto-vegetarian"],
    "mealType": "dessert-snack",
    "difficulty": "easy",
    "prepTime": 10,
    "cookTime": 20,
    "spiceLevel": "mild",
    "servings": 6,
    "calories": 320,
    "protein": 5,
    "carbs": 40,
    "fat": 15,
    "allergens": ["gluten", "dairy"],
    "cookingMethod": "stovetop-stirring",
    "specialDiet": ["vegetarian"],
    "occasionTags": ["festive-dish", "ramadan-iftar"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "1 cup Whole Wheat Flour (or specialized Emirati flour)",
      "1/2 cup Ghee (Clarified Butter)",
      "1 cup Sugar or Date Syrup (Dibbs)",
      "1.5 cups Water",
      "1/2 tsp Cardamom powder",
      "Saffron threads, soaked in warm water",
      "Chopped Nuts (Pistachios, Almonds) for garnish"
    ],
    "requiredIngredients": ["flour", "ghee", "sugar/dibbs", "cardamom"],
    "instructions": [
      "In a dry, heavy-bottomed pan, toast the whole wheat flour over medium-low heat. Stir continuously for 10-15 minutes until the flour turns a medium golden-brown color and smells intensely nutty. Be careful not to burn it.",
      "Sift the toasted flour to remove any lumps and set aside.",
      "In a separate pot, prepare the syrup: combine the water, sugar (or date syrup), cardamom powder, and saffron-infused water. Bring to a boil until the sugar dissolves.",
      "In the original pan, melt the ghee over low heat.",
      "Gradually add the toasted flour to the melted ghee, stirring constantly to form a thick, golden paste (roux).",
      "Slowly pour the hot syrup mixture into the flour-ghee paste while stirring vigorously to prevent lumps from forming.",
      "Continue to cook the mixture over medium-low heat, stirring constantly, for 5-10 minutes until the mixture pulls away from the sides of the pot and forms a thick, dense pudding.",
      "Press the Khabeesa into a serving dish or individual molds while it is still warm.",
      "Garnish generously with chopped nuts (pistachios and almonds) and a light sprinkle of cardamom.",
      "Serve warm or at room temperature alongside Arabic coffee."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Fanni (Bedouin Baked Bread)",
    "imageName": "fanni",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/fanni.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Bedouin/Desert",
    "isVegetarian": true,
    "healthTags": ["high-fiber", "whole-grains"],
    "dietaryTags": ["vegan"],
    "mealType": "breakfast-side-dish",
    "difficulty": "easy",
    "prepTime": 60,
    "cookTime": 20,
    "spiceLevel": "mild",
    "servings": 4,
    "calories": 200,
    "protein": 6,
    "carbs": 38,
    "fat": 3,
    "allergens": ["gluten"],
    "cookingMethod": "baking-traditional-ash",
    "specialDiet": ["vegetarian", "vegan"],
    "occasionTags": ["traditional-cuisine", "everyday"],
    "storageType": "best-fresh",
    "kidFriendly": true,
    "ingredients": [
      "2 cups Whole Wheat Flour (or a mix with white flour)",
      "1 tsp Salt",
      "1 tsp Yeast",
      "1 cup Warm Water",
      "Optional: Sesame seeds, Nigella seeds"
    ],
    "requiredIngredients": ["whole wheat flour", "yeast", "water", "salt"],
    "instructions": [
      "In a large bowl, combine the flour, salt, and yeast. Gradually add the warm water, mixing until a stiff, shaggy dough forms.",
      "Knead the dough on a lightly floured surface for 5-10 minutes until it is smooth and elastic.",
      "Cover the dough and let it rise in a warm place for 45-60 minutes, or until doubled in size.",
      "Punch down the dough gently and divide it into 3-4 equal portions. Roll each portion into a flat, thick disc (about 1 inch thick).",
      "Traditionally, Fanni is cooked directly on hot ash (*Al-Milla*) in the desert, but for modern cooking, preheat the oven to 200°C (400°F).",
      "Place the thick dough discs directly onto a baking stone or a lightly floured baking sheet.",
      "If desired, score the top of the bread and sprinkle with sesame or nigella seeds.",
      "Bake for 15-20 minutes, or until the bread is fully cooked through and the crust is firm and golden brown.",
      "Alternatively, use a heavy cast-iron pan over medium-high heat, cooking the bread for 7-10 minutes per side.",
      "The final bread should be dense and hearty. Brush lightly with oil or ghee after baking.",
      "Serve the Fanni warm, usually torn and eaten with cheese, yogurt, or dipping into stews."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Jasheed with Fresh Herbs (Haswa)",
    "imageName": "jasheed_haswa",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/jasheed_haswa.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Coastal",
    "isVegetarian": false,
    "healthTags": ["high-protein", "nutrient-rich"],
    "dietaryTags": ["gluten-free-option"],
    "mealType": "dinner",
    "difficulty": "medium",
    "prepTime": 20,
    "cookTime": 45,
    "spiceLevel": "medium",
    "servings": 4,
    "calories": 650,
    "protein": 45,
    "carbs": 55,
    "fat": 28,
    "allergens": ["fish"],
    "cookingMethod": "stovetop-steaming",
    "specialDiet": ["pescatarian"],
    "occasionTags": ["traditional-cuisine", "coastal-specialty"],
    "storageType": "best-fresh",
    "kidFriendly": false,
    "ingredients": [
      "500g Fish (Shark or Kingfish), par-boiled and flaked",
      "2 cups Basmati Rice",
      "3 large Onions, finely chopped",
      "2 Tomatoes, chopped",
      "Dried Limes (Loomi), Jesheed Spice Mix",
      "Garlic, Ginger, Green Chilies",
      "Fresh Herbs (Parsley, Dill, Coriander), chopped",
      "Oil/Ghee, Salt, Water"
    ],
    "requiredIngredients": ["flaked fish", "basmati rice", "dried limes", "fresh herbs"],
    "instructions": [
      "Prepare the fish: flake the par-boiled fish (shark or kingfish). Set aside. Wash and soak the rice for 30 minutes, then drain.",
      "In a large pot, heat oil and sauté the finely chopped onions until softened and golden brown.",
      "Add minced garlic, ginger, green chilies, Jesheed spice mix, and crumbled dried limes. Fry for 1-2 minutes.",
      "Add the chopped tomatoes and cook until they break down to form a thick sauce.",
      "Add the flaked fish to the pot. Stir well to combine with the spices and tomatoes.",
      "Stir in a generous amount of chopped fresh herbs (parsley, dill, and coriander).",
      "Add the drained Basmati rice on top of the fish mixture. Pour in enough hot water to ensure the rice cooks properly.",
      "Cover the pot tightly and cook on very low heat for 20-25 minutes, or until the rice is cooked and fluffy (*Dum* method).",
      "Gently fluff the Jesheed with a fork before serving, mixing the seasoned fish and rice throughout.",
      "Garnish with extra fresh herbs and serve hot, often with a side of mango pickle or yogurt."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Muhalla (Emirati Sweet Crêpes)",
    "imageName": "muhalla",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/muhalla.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide",
    "isVegetarian": true,
    "healthTags": ["breakfast", "sweet-snack"],
    "dietaryTags": ["ovo-lacto-vegetarian"],
    "mealType": "breakfast-dessert",
    "difficulty": "easy",
    "prepTime": 15,
    "cookTime": 15,
    "spiceLevel": "mild",
    "servings": 4,
    "calories": 210,
    "protein": 8,
    "carbs": 30,
    "fat": 5,
    "allergens": ["gluten", "eggs", "dairy"],
    "cookingMethod": "stovetop-pan-fry",
    "specialDiet": ["vegetarian"],
    "occasionTags": ["everyday", "tea-time"],
    "storageType": "best-fresh",
    "kidFriendly": true,
    "ingredients": [
      "1 cup All-Purpose Flour",
      "1 cup Milk or Water (often fermented with yeast)",
      "1 Egg",
      "Pinch of Saffron threads",
      "1/2 tsp Cardamom powder",
      "A pinch of Sugar/Salt",
      "Ghee or Butter for cooking",
      "Date Syrup (Dibbs) or Honey for serving"
    ],
    "requiredIngredients": ["flour", "milk/water", "egg", "saffron", "ghee"],
    "instructions": [
      "In a large bowl, whisk together the flour, egg, milk/water, saffron, cardamom, and a pinch of salt/sugar until a very thin, smooth batter forms.",
      "Allow the batter to rest at room temperature for 15 minutes.",
      "Heat a non-stick frying pan or griddle over medium heat. Lightly grease the pan with a small amount of ghee or oil.",
      "Pour a small amount of batter onto the pan, swirling it quickly to create a very thin, round crepe.",
      "Cook for 1-2 minutes until the edges are golden and the surface is set (similar to a French crepe).",
      "Flip the Muhalla crepe and cook the other side for about 30 seconds.",
      "Cook all the crepes in batches, stacking them on a plate to keep them warm.",
      "Serve the Muhalla crepes warm, folded or rolled.",
      "Traditionally, they are served drizzled generously with date syrup (Dibbs) or local honey.",
      "Muhalla is a delicate, fragrant version of the local flatbread/pancake."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Shora Bahr (Seafood Soup)",
    "imageName": "shora_bahr",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/shora_bahr.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Coastal",
    "isVegetarian": false,
    "healthTags": ["low-fat", "high-protein", "omega-3"],
    "dietaryTags": ["gluten-free", "dairy-free"],
    "mealType": "appetizer-soup",
    "difficulty": "easy",
    "prepTime": 20,
    "cookTime": 30,
    "spiceLevel": "mild-medium",
    "servings": 4,
    "calories": 220,
    "protein": 30,
    "carbs": 10,
    "fat": 5,
    "allergens": ["shellfish", "fish"],
    "cookingMethod": "stovetop-simmering",
    "specialDiet": ["pescatarian", "low-carb"],
    "occasionTags": ["ramadan-iftar", "everyday"],
    "storageType": "best-fresh",
    "kidFriendly": true,
    "ingredients": [
      "500g Mixed Seafood (Fish fillets, Prawns, Calamari)",
      "1 large Onion, finely chopped",
      "2 Carrots, diced",
      "2 stalks Celery, diced",
      "3 cups Fish or Vegetable Stock",
      "Garlic, Ginger, Turmeric, Cumin",
      "Fresh Coriander, Lemon Juice",
      "Optional: 1 Tbsp Tomato Paste"
    ],
    "requiredIngredients": ["mixed seafood", "fish stock", "onion", "turmeric"],
    "instructions": [
      "Prepare the seafood: clean, peel, and chop the fish, prawns, and calamari into bite-sized pieces.",
      "In a large pot, heat olive oil and sauté the finely chopped onion until soft.",
      "Add minced garlic and ginger, followed by the diced carrots and celery. Cook for 5 minutes.",
      "Stir in the spices: turmeric, cumin, salt, and black pepper. Add tomato paste (optional) and cook for 1 minute.",
      "Pour in the fish or vegetable stock and bring the mixture to a slow boil.",
      "Reduce the heat, cover, and simmer for 15 minutes to soften the vegetables and deepen the broth's flavor.",
      "Add the prepared mixed seafood to the simmering broth. Cook for only 3-5 minutes, or until the seafood is just cooked through (overcooking makes it tough).",
      "Remove from the heat. Stir in the fresh lemon juice and fresh chopped coriander.",
      "Taste and adjust the seasoning. The soup should be light, savory, and tangy.",
      "Serve the Shora Bahr piping hot, often accompanied by croutons or Arabic bread."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Baleelat Al-Bahr (Sweet Seafood Curry)",
    "imageName": "baleelat_al_bahr",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/baleelat_al_bahr.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Coastal/Novel",
    "isVegetarian": false,
    "healthTags": ["high-protein", "omega-3"],
    "dietaryTags": ["dairy-free-option"],
    "mealType": "dinner",
    "difficulty": "medium",
    "prepTime": 20,
    "cookTime": 40,
    "spiceLevel": "medium",
    "servings": 4,
    "calories": 480,
    "protein": 30,
    "carbs": 25,
    "fat": 25,
    "allergens": ["shellfish", "fish"],
    "cookingMethod": "stovetop-simmering",
    "specialDiet": ["pescatarian"],
    "occasionTags": ["traditional-cuisine", "seafood-specialty"],
    "storageType": "refrigerate",
    "kidFriendly": false,
    "ingredients": [
      "500g Mixed Seafood (Fish, Prawns, Crab)",
      "2 large Onions, chopped",
      "2 Tomatoes, chopped",
      "Emirati Bzaar Spice Mix, Turmeric, Cumin",
      "Coconut Milk (optional for richness)",
      "Garlic, Ginger, Green Chilies",
      "Tamarind Paste (for tang), Salt, Sugar",
      "Oil/Ghee"
    ],
    "requiredIngredients": ["mixed seafood", "bzaar spice", "tamarind", "coconut milk/stock"],
    "instructions": [
      "Clean and prepare all the seafood. Marinate lightly with turmeric and salt.",
      "In a large pot, heat oil or ghee and sauté the chopped onion until softened.",
      "Add minced garlic, ginger, and green chilies. Fry for 1-2 minutes until fragrant.",
      "Stir in the Emirati Bzaar spice mix, turmeric, and cumin. Fry for 1 minute.",
      "Add the chopped tomatoes and cook until they break down to form a thick sauce.",
      "Stir in the tamarind paste, salt, and sugar. The sauce should be savory with a touch of sweetness and sourness.",
      "Add the seafood to the pot and stir gently to coat.",
      "Pour in enough water or thin coconut milk to create a rich gravy. Bring to a slow boil.",
      "Reduce the heat, cover, and simmer for 15-20 minutes until the seafood is cooked through and the gravy has thickened.",
      "Adjust the seasoning. Serve the Baleelat Al-Bahr hot.",
      "This dish is often served with white rice or Khameer bread, but is sometimes enjoyed on its own as a hearty seafood curry."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Aseeda (Sorghum Porridge)",
    "imageName": "aseeda",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/aseeda.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Traditional/Ramadan",
    "isVegetarian": true,
    "healthTags": ["high-fiber", "complex-carbs"],
    "dietaryTags": ["dairy-free-option"],
    "mealType": "dessert-side-dish",
    "difficulty": "medium",
    "prepTime": 15,
    "cookTime": 45,
    "spiceLevel": "mild",
    "servings": 6,
    "calories": 300,
    "protein": 5,
    "carbs": 55,
    "fat": 8,
    "allergens": ["gluten-free-sorghum"],
    "cookingMethod": "stovetop-stirring",
    "specialDiet": ["vegetarian", "vegan-option"],
    "occasionTags": ["ramadan", "traditional-cuisine"],
    "storageType": "best-fresh",
    "kidFriendly": true,
    "ingredients": [
      "1 cup Sorghum Flour (or Wheat/Barley flour)",
      "3 cups Water",
      "1/2 cup Sugar or Honey",
      "Ghee (Clarified Butter)",
      "Cardamom powder (optional)",
      "Dates or Nuts (for garnish)"
    ],
    "requiredIngredients": ["sorghum flour", "water", "sugar/honey", "ghee"],
    "instructions": [
      "Mix the sorghum flour with a small amount of cold water to form a thick paste; ensure there are no lumps.",
      "In a separate pot, combine the remaining water and sugar (or honey). Bring to a boil until the sugar dissolves.",
      "Slowly pour the flour paste into the boiling water/syrup mixture, stirring constantly and vigorously to prevent lumps.",
      "Reduce the heat to low and continue stirring the porridge (Aseeda) constantly for 30-40 minutes.",
      "The Aseeda will thicken significantly and become very dense and glossy, pulling away from the sides of the pot.",
      "The stirring is essential for developing the texture.",
      "Once cooked, the Aseeda should resemble a thick, smooth dough or pudding.",
      "Scoop the Aseeda into serving bowls while still hot.",
      "Create a small well in the center of the Aseeda using a spoon.",
      "Fill the well generously with hot melted ghee.",
      "Garnish with chopped dates or nuts and serve immediately while hot, using the ghee as the rich dipping sauce."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Fogat Zabaidi (Shrimp Rice)",
    "imageName": "fogat_zabaidi",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/fogat_zabaidi.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Coastal",
    "isVegetarian": false,
    "healthTags": ["high-protein", "omega-3"],
    "dietaryTags": ["gluten-free-option"],
    "mealType": "dinner",
    "difficulty": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "spiceLevel": "medium",
    "servings": 4,
    "calories": 600,
    "protein": 35,
    "carbs": 65,
    "fat": 20,
    "allergens": ["shellfish"],
    "cookingMethod": "stovetop-steaming",
    "specialDiet": ["pescatarian"],
    "occasionTags": ["family-meal", "coastal-cuisine"],
    "storageType": "refrigerate",
    "kidFriendly": true,
    "ingredients": [
      "500g Fresh Prawns (Zabaidi), peeled and deveined",
      "2 cups Basmati Rice",
      "2 large Onions, sliced",
      "2 Tomatoes, chopped",
      "Emirati Bzaar Spice Mix, Turmeric, Cumin",
      "Dried Limes (Loomi), Garlic, Ginger",
      "Saffron threads, soaked in warm water",
      "Oil/Ghee, Salt, Fresh Coriander"
    ],
    "requiredIngredients": ["prawns", "basmati rice", "dried limes", "bzaar spice"],
    "instructions": [
      "Wash the Basmati rice and soak in cold water for 30 minutes. Drain well.",
      "In a large pot, heat oil or ghee and sauté the sliced onions until deeply golden brown and caramelized.",
      "Add the minced garlic, ginger, and the whole Bzaar spice mix, dried limes, and turmeric. Fry for 2-3 minutes.",
      "Add the chopped tomatoes and cook until they break down to form a thick sauce.",
      "Add the cleaned prawns and cook for only 2-3 minutes until they just begin to change color.",
      "Add enough hot water or stock to make the broth needed to cook the rice, season with salt, and bring to a boil.",
      "Add the drained Basmati rice to the boiling broth. Ensure the liquid level is correct for cooking the rice.",
      "Once the liquid reduces to the surface of the rice, create a few small holes in the rice.",
      "Drizzle the saffron-infused water over the rice, cover tightly, and steam on very low heat for 15-20 minutes until the rice is cooked and fluffy.",
      "Gently fluff the rice with a fork before serving, mixing the prawns and seasoned rice throughout.",
      "Serve hot, garnished with fresh chopped coriander and fried onions."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Zanjabil (Ginger Infused Coffee)",
    "imageName": "zanjabil",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/zanjabil.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Nationwide Beverage",
    "isVegetarian": true,
    "healthTags": ["stimulant", "anti-inflammatory"],
    "dietaryTags": ["gluten-free", "vegan"],
    "mealType": "beverage",
    "difficulty": "easy",
    "prepTime": 5,
    "cookTime": 10,
    "spiceLevel": "medium",
    "servings": 4,
    "calories": 10,
    "protein": 0,
    "carbs": 2,
    "fat": 0,
    "allergens": [],
    "cookingMethod": "boiling",
    "specialDiet": ["vegetarian", "vegan"],
    "occasionTags": ["everyday", "hospitality"],
    "storageType": "best-fresh",
    "kidFriendly": false,
    "ingredients": [
      "4 cups Water",
      "4 Tbsp Arabic Coffee (lightly roasted)",
      "2-3 inches Fresh Ginger, peeled and sliced or crushed",
      "1/2 tsp Cardamom powder",
      "Saffron threads (optional)",
      "Sweetener (Sugar or Honey, optional)"
    ],
    "requiredIngredients": ["arabic coffee", "ginger", "cardamom"],
    "instructions": [
      "In a traditional Arabic coffee pot (Dallah) or a regular saucepan, combine the water and the Arabic coffee.",
      "Bring the mixture to a boil over medium-high heat. Reduce the heat immediately and let it simmer for 5 minutes.",
      "Remove the pot from the heat and let the coffee grounds settle for 1 minute.",
      "Add the freshly sliced or crushed ginger and the cardamom powder to the coffee.",
      "Return the pot to the stove and simmer gently for another 5 minutes to allow the ginger to infuse fully.",
      "If using, add saffron threads during this simmering stage.",
      "Remove the pot from the heat and allow the coffee grounds and spices to settle one final time.",
      "Strain the coffee through a fine sieve into a clean Dallah or serving vessel.",
      "If serving sweetened, add the sugar or honey directly to the strained coffee or serve it on the side.",
      "Serve the Zanjabil hot in small, traditional cups (Finjan).",
      "This ginger-spiced coffee is a staple of Emirati hospitality, offering a warm, pungent flavor."
    ],
    "youtubeUrl": ""
  },
  {
    "name": "Hubuloo (Crushed Date and Spiced Paste)",
    "imageName": "hubuloo",
    "imageUrl": "https://again2umm-cell.github.io/Aaj_kya_Banaau/images_countries/uae/hubuloo.png",
    "cuisine": "Emirati",
    "country": "UAE",
    "regionalVariety": "Desert/Bedouin",
    "isVegetarian": true,
    "healthTags": ["high-fiber", "natural-sweetener"],
    "dietaryTags": ["gluten-free", "vegan"],
    "mealType": "dessert-snack",
    "difficulty": "easy",
    "prepTime": 10,
    "cookTime": 15,
    "spiceLevel": "mild",
    "servings": 10,
    "calories": 170,
    "protein": 2,
    "carbs": 30,
    "fat": 5,
    "allergens": [],
    "cookingMethod": "stovetop-mashing",
    "specialDiet": ["vegetarian", "vegan"],
    "occasionTags": ["traditional-cuisine", "everyday"],
    "storageType": "airtight-container",
    "kidFriendly": true,
    "ingredients": [
      "2 cups Soft Pitted Dates (best quality)",
      "1/4 cup Ghee (Clarified Butter, use plant-based for vegan)",
      "1/2 tsp Cardamom powder",
      "1/4 tsp Ginger powder",
      "1/4 cup Crushed Dried Limes (Loomi, optional but traditional for flavor complexity)",
      "Nuts/Seeds (optional for garnish)"
    ],
    "requiredIngredients": ["soft dates", "ghee", "cardamom"],
    "instructions": [
      "If using dried dates, soak them in hot water for 15 minutes to soften, then drain and mash. If using soft dates, skip this step.",
      "In a heavy-bottomed pan, melt the ghee over low heat.",
      "Add the pitted, mashed dates to the melted ghee.",
      "Stir and mash the dates continuously for 5-10 minutes until the dates are fully heated and form a smooth, thick paste.",
      "Stir in the cardamom powder, ginger powder, and the crushed dried limes (if using). The lime adds a surprising, slight tang.",
      "Continue to cook and mix for another 3-5 minutes, ensuring the spices are fully incorporated.",
      "The Hubuloo mixture should be uniform and very thick.",
      "Press the hot Hubuloo mixture into a flat layer in a serving dish or roll it into small balls.",
      "Garnish the top with chopped nuts or sesame seeds.",
      "Hubuloo is served at room temperature or slightly warm, traditionally accompanied by Arabic coffee or tea."
    ],
    "youtubeUrl": ""
  }


  ]
}
